# 교차 분석(카이 제곱, 카이스퀘어) 가설 검정
# 범주형 자료(변수)를 대상으로  교차빈도에 대한 기술 통계량을 사용
# 교차빈도에 대한 통계적 유의성을 검증해 주는 분석 기법

# 분산이 퍼져있는 모습을 분포로 만든 것이 카이제곱 분포
# X^2 = ∑(관측값 - 기댓값)^2 / 기댓값

# 독립성, 적합도 검정, 분산에 대한 검정, 회귀 분석의 잔차제곱합(SSE) 분석
# 특징 : 항상 양수, 비대칭적 분포(자유도에 따라 모양이 바뀜)

# 실습 - 적합도 검정
# 카이제곱 검정의 정식명칭은 "pearson's chi-square test"
# 두 개의 불연속변수(범주형) 간의 상관관계를 측정. 관찰빈도가 통계적으로 유의한지 확인

# 가설을 채택하는 두 가지 방법 연습
import pandas as pd

# 공부 여부와 합격여부 사이에 연관성이 있는가?
# 공부함(범주형), 공부안함(범주형)
data = pd.read_csv("pass_cross.csv", encoding="cp949")
print(data.head())
print(data.shape) # (50, 4)
print()

# 귀무가설(H0) : 벼락치기 공부하는 것과 합격여부는 관계가 없다.
# 대립가설(H1) : 벼락치기 공부하는 것과 합격여부는 관계가 있다.

print(data[(data['공부함'] == 1) & (data['합격'] == 1)].shape[0])  # 18
print(data[(data['공부함'] == 1) & (data['불합격'] == 1)].shape[0])  # 7
print('방법1 빈도표 ------')
ctab = pd.crosstab(index=data['공부안함'], columns=data['불합격'], margins=True)
ctab.columns = ['합격', '불합격', '행합']
ctab.index = ['공부함', '공부안함', '열합']
print(ctab) # 관찰값(빈도)
# 기대돗수 =(각행의 주변 합) * (각열의 주변합) / 총합(전체 표본수)
chi2 = ((18-15) ** 2 / 15 + (7-10)**2 /10) + ((12 -15) ** 2 /15 +(13-10) ** 2 / 10)
print("검정통계량 chi2",chi2) # 3.0
# df = 2 - 1 = 1
# 유의수준 : 0.05
# 임계값(critical value) - h0를 기각할지 결정하는 경계값 : 3.84 (카이제곱 분포표 기준)
# 판정 : 검정 통계량 chi2이 3.0 < 임계값 3.84이므로 귀무 채택역 내에 있으므로 귀무가설 채택영역에 없다.
# 그러므로 벼락치기 공부하는 것과 합격여부는 관계가 없다.는 의견 유지됨

print('\n방법2 : p-value 사용')
import scipy.stats as stats
observed = ctab.iloc[:2, :2]
chi2, p, _,_ = stats.chi2_contingency(observed,
                                    correction=False)
print('검정 통계량 값', chi2) # 3.0
print('유의 확률 (p값) : ', p) # 0.08326451666355042
# 판정 : 유의 수준 0.05 < p : 0.0832이므로 귀무가설 채택
# 검정에 사용된 자료는 우연히 발생한 자료라고 할 수 있다.
# 유의 수준 5%에서 유의한 연관성이 있다고 판단하기에는 증거가 충분하지않다.

# 참고 : p-value가 0.05보다 크다고 해서 귀무가설이 옳다는 뜻은 아니다. 확정 아님~~~
# 현재 데이터만으로 귀무가설을 기각할 만큼 충분한 통계적 근거가 없다는 뜻이다.